УТ_для_edt/src/InformationRegisters/смартОборудованиеЧернилаКлиентов/смартОборудованиеЧернилаКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартОборудованиеЧернилаКлиентов</name>
  <comment>//++ #1305 смарт: Фролов 06.02.2023 //Отчет Стоимость использования оборудования</comment>
  <resources>
    <name>Количество</name>
    <comment>//++ #1305 смарт: Фролов 06.02.2023 //Отчет Стоимость использования оборудования</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МотоРесурс</name>
    <comment>//++ #1305 смарт: Фролов 06.02.2023 //Отчет Стоимость использования оборудования</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>АвторИзменения</name>
    <comment>#1741 смарт: Лопато 03.04.2024 //Доработать регистр сопоставления оборудования клиентов</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <comment>#1741 смарт: Лопато 03.04.2024 //Доработать регистр сопоставления оборудования клиентов</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <comment>//++ #1305 смарт: Фролов 06.02.2023 //Отчет Стоимость использования оборудования</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОборудованиеКлиентов</name>
    <comment>//++ #1305 смарт: Фролов 06.02.2023 //Отчет Стоимость использования оборудования</comment>
    <type>
      <types>CatalogRef.смартОборудованиеКлиентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СопоставлениеСТоваром</name>
    <comment>//++ #1305 смарт: Фролов 06.02.2023 //Отчет Стоимость использования оборудования</comment>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/смартОборудованиеЧернилаКлиентов/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЭтаФорма.Параметры.ЗначенияЗаполнения.Свойство("ОборудованиеКлиентов") Тогда
		Запись.ОборудованиеКлиентов= ЭтаФорма.Параметры.ЗначенияЗаполнения.ОборудованиеКлиентов;
		Элементы.ОборудованиеКлиентов.ТолькоПросмотр=Истина;
	ИначеЕсли ЭтаФорма.Параметры.ЗначенияЗаполнения.Свойство("Номенклатура") Тогда	
		Запись.Номенклатура= ЭтаФорма.Параметры.ЗначенияЗаполнения.Номенклатура;		
		Элементы.Номенклатура.ТолькоПросмотр=Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СопоставлениеСТоваромПриИзменении(Элемент)
	Если Запись.СопоставлениеСТоваром Тогда
		Запись.Количество=0;
		Запись.МотоРесурс=0;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоМоторесурсПриИзменении(Элемент)
	Если Запись.Количество>0 ИЛИ Запись.МотоРесурс>0 Тогда
		Запись.СопоставлениеСТоваром=Ложь;	
	КонецЕсли;	
КонецПроцедуры
